.emacs.d/init.org
** TODO Backline - heading background to edge - doesnt work 
#+BEGIN_SRC emacs-lisp
;;(use-package backline
;;  :ensure t
;;  :after outline
;;  :config (advice-add 'outline-flag-region :after 'backline-update))
#+END_SRC
** Block Templates
#+BEGIN_SRC emacs-lisp
 (require 'org-tempo)

(add-to-list 'org-structure-template-alist '("sh" . "src sh"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("sc" . "src scheme"))
(add-to-list 'org-structure-template-alist '("ts" . "src typescript"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
(add-to-list 'org-structure-template-alist '("yaml" . "src yaml"))
(add-to-list 'org-structure-template-alist '("json" . "src json"))
(add-to-list 'org-structure-template-alist '("cpp" . "src cpp"))
#+END_SRC
* Custom Functions

** Add Screenshots to Org Files

#+BEGIN_SRC emacs-lisp
(defun my-org-scrot ()
  "Take a screenshot into a time stamped unique-named file in the
same directory as the org-buffer and insert a link to this file."
  (interactive)
  (if (not (file-exists-p "images"))
      (make-directory "images")
      (message "Directory Exists"))
  (setq filename
        (concat
         (make-temp-name
          (concat (file-name-directory (buffer-file-name))
		  "images/"
		  (file-name-base (buffer-file-name))
                  "_"
                  (format-time-string "%Y%m%d_%H%M%S_")) ) ".png"))
  (call-process "import" nil nil nil filename)
  (insert (concat "[[" filename "]]"))
  (org-display-inline-images))
#+END_SRC

** Fix Control Backspace

#+BEGIN_SRC emacs-lisp

(defun fix-bkw ()
  "Remove all whitespace if the character behind the cursor is whitespace, otherwise remove a word."
  (interactive)
  (if (looking-back "[ \n]")
      ;; delete horizontal space before us and then check to see if we
      ;; are looking at a newline
      (progn (delete-horizontal-space 't)
             (while (looking-back "[ \n]")
               (backward-delete-char 1)))
    ;; otherwise, just do the normal kill word.
    (backward-kill-word 1)))

(global-set-key [C-backspace] 'fix-bkw)

#+END_SRC

* Custom Set variables

#+BEGIN_SRC emacs-lisp

(custom-set-variables
 ;; custom-set-variables  was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(ivy-mode t)
 '(package-selected-packages
   '(ivy-rich rainbow-delimiters doom-modeline ivy org-bullets which-key use-package try)))
(custom-set-faces

 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right. dsadcsa
 )
#+END_SRC

* Keybindings (Evil)
** General Binding and Leader Key
   
#+BEGIN_SRC emacs-lisp
(use-package general
  :ensure t
  :config
  (general-create-definer cmacs/leader-keys
    :keymaps '(normal insert visual emacs)
    :prefix "SPC"
    :global-prefix "C-SPC")
  (cmacs/leader-keys
    "t"  '(:ignore t :which-key "toggles")
    "tt" '(counsel-load-theme :which-key "choose theme")
    "SPC" '(evil-avy-goto-word-1 :which-key "Jump to word")))
    
(general-define-key
"C-M-j" 'counsel-switch-buffer
"<escape>" 'keyboard-escape-quit
"H-x" 'compile
"H-c" 'recompile
"H-<tab>" 'hs-show-block
"H-q" 'hs-hide-block
"H-w" 'hs-show-all
"H-e" 'hs-hide-all)

;;Make ESC quit prompts
;;(global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+END_SRC

Jump to line then to word in that line
"SPC" '( lambda () (interactive) (evil-avy-goto-line) (evilem-motion-forward-word-begin)) :which-key "Jump to word"))


** Evil Mode

#+BEGIN_SRC emacs-lisp
(use-package evil
  :ensure t
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump nil)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

  ;; Use visual line motions even outside of visual-line-mode buffers
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))
 
(use-package evil-collection
  :ensure t
  :after evil
  :config
  (evil-collection-init))

(use-package evil-magit
  :ensure t
  :after magit)
;;Switch Buffer
;;(global-set-key (kbd "C-M-j") 'counsel-switch-buffer)
#+END_SRC

** Evil easymotion

   #+begin_src emacs-lisp
   (use-package evil-easymotion
   :ensure t)
   
;;(with-eval-after-load "evil-easymotion"
(general-define-key
     :states '(normal insert visual)
     "H-l" '(:keymap evilem-map :package evil-easymotion))
 
;;(evilem-default-keybindings "H-l")    
   
   #+end_src

* Hydra

#+BEGIN_SRC emacs-lisp
(use-package hydra
  :ensure t)

(defhydra hydra-buffer-swap (:timeout 4)
  "Swap Buffer"
  ("h" next-buffer "next")
  ("l" previous-buffer "prev")
  ("f" nil "finished" :exit t))
#+END_SRC
